Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: རྒྱུན་མ་ཆད་པའི་ཚུལ་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་བསྔགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཤི་འཕོ་དང་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ལུས་ཡོངས་སུ་བཟུང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། མིང་གི་འཁོར་ལོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གན་དུ་འགྲོ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། སངས་རྒྱས་བྱུང་སྟེ་བསྙེན་བཀུར་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཆོས་ཀྱི་ཚིག་དང་། ཡི་གེ་བླངས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་ནན་ཏན་གྱི་སེམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཏིང་ངེ་འཛིན་ཐོབ་པས་སངས་རྒྱས་མཐོང་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཞིང་མཐོང་བའི་མིག་གི་རྒྱས་པར་བཀང་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བསྐལ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་ཡེ་ཤེས་ཀྱི་འཁོར་ལོ་འདབ་ཆགས་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ལ་རྣམ་པར་ལྟ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོར་གཏོགས་པའི་སེམས་ཅན་ཕ་རོལ་གྱི་ཤི་འཕོ་དང་། སྐྱེ་བ་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ལྷའི་རྣ་བ་ཡོངས་སུ་དག་པ་རྟོགས་པར་བྱེད་པའི་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ལ་རྣམ་པར་བལྟ་ཞིང་དབྱིངས་ལ་འཇུག་པའི་སྒོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་ལྷའི་མིག་ལ་ཞུགས་པའི་སྒོ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་ལྷའི་རྣ་བ་རྣམ་པར་དམིགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་སེམས་ཅན་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་བདག་དང་སེམས་ཅན་ཕ་རོལ་གྱི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་ཤེས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། ཐོག་མ་དངོས་པོ་མེད་པ་ལ་རབ་ཏུ་གནས་ཏེ།
en: the constant succession of honoring the appearance of a buddha; the constant succession of acquiring the sentences and syllables of the Dharma; the constant succession of the motivation to practice the bodhisattva path; the constant succession of attaining samādhi; the constant succession of seeing buddhas through having attained samādhi; the constant succession of the expanding vision that sees the realms; the constant wheel of the knowledge of the succession of the kalpas; the constant succession of the knowledge that comprehends the realm of phenomena; the constant succession of seeing the natures of beings; the constant succession of knowing the successive passing and rebirth of beings who are within the ocean of the ways of the realm of phenomena; the constant succession of understanding pure divine hearing; the constant succession of the gateways for entering into the continuum of looking into the minds of the entire realm of beings; the constant succession of gateways for first entering divine sight; the constant succession of the first perception through divine hearing; the constant succession of the first knowledge of the minds of other beings; the constant succession of the first knowledge of the memory of the previous lifetimes of herself and others;

source: མངོན་པར་འདུ་བྱ་བ་མྱེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པའི་རྐྱེན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆག་པ་དང་། རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་གནོན་པས།
en: the constant succession of the first conditions for attaining miraculous activity through being established in the absence of existence; the constant succession of spreading the prowess of miraculous powers throughout the directions;

source: ཕྱོགས་རྒྱས་པ་འགེངས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཐོབ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོའི་ཚུལ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་འཇུག་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་གནོན་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མིང་དུ་བྱ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་འཇུག་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་ནས།
en: the constant succession of attaining bodhisattva liberations; the constant succession of realizing the inconceivable ways of an ocean of bodhisattva liberations; the constant succession of the miraculous manifestations of bodhisattva samādhi; the constant succession of bodhisattva prowess; the constant succession of bodhisattva domination; the constant succession of gaining the title of bodhisattva;

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་ཅིང་འདབ་ཆགས་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སྤྲུལ་པའི་ལུས་ཀྱི་སྤྲིན་དུ་མངོན་པར་འཐོན་ཏོ།
en: the constant succession of entering the bodhisattva path; and the night goddess Pramudita­nayana­jagad­virocanā’s constant succession of bodhisattva knowledge all issued from all her pores as clouds of emanated bodies that he then saw teaching the Dharma to beings.

source: །སེམས་ཅན་རྣམས་ལ་ཆོས་འཆད་པ་དང་། ཡང་དག་པར་སྟོན་པ་དང་། གསལ་བར་བྱེད་པ་དང་། ཡོངས་སུ་སྟོན་པ་དང་། རྗེས་སུ་རྗོད་པ་དང་། རབ་ཏུ་འབྱེད་པ་དང་། ཤིན་ཏུ་རྒྱ་ཆེར་བྱེད་པ་དང་། འགྲང་བ་དང་། ངེས་པར་སྟོན་པ་དང་། རྣམ་པར་རིག་པར་བྱེད་པ་དང་། ཉེ་བར་བསྒྲུབ་པ་མཐོང་སྟེ། ལ་ལ་ལ་ནི་རླུང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་འཁྲུགས་པའི་སྒྲ་སྐད་ཀྱིས་ཆོས་སྟོན་པར་མཐོང་ངོ་། །ལ་ལ་ལ་ནི་ཆུའི་ཕུང་པོ་རབ་ཏུ་རློབ་པའི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་མེའི་མེ་ལྕེ་ཤིན་ཏུ་རློབ་པའི་སྒྲ་སྐད་ཀྱིས།
en: He saw them declaring it, elucidating it, revealing it, communicating it, categorizing it, expanding upon it, enumerating it, giving instruction on it, making it known, and accomplishing it.

source: ལ་ལ་ལ་ནི་རྒྱ་མཚོའི་འབྲུག་གི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ས་ཡོངས་སུ་གཡོས་པའི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་རི་ཆེན་པོ་ཕན་ཚུན་ཐུག་ཅིང་འཐབ་པའི་སྒྲ་སྐད་ཀྱིས་ལ་ལ་ལ་ནི་ལྷའི་གྲོང་ཁྱེར་གཡོས་པའི་ང་རོ་སྙན་པའི་སྒྲ་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྷའི་གཞལ་མེད་ཁང་འཐུབ་ཅིང་འཁྲོལ་བའི་སྒྲ་སྐད་ཀྱིས་ཆོས་སྟོན་པ་མཐོང་ངོ་། །ལ་ལ་ལ་ནི་ལྷའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ཀླུའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་གནོད་སྦྱིན་གྱི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་དྲི་ཟའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་མིའམ་ཅིའི་དབང་པོའི་སྐད་ཀྱིས།
en: He saw some teaching the Dharma through speech from the sound of shaking in a domain of wind, some through speech from the sound of crashing waves on a mass of water, some through speech from the sound of the roaring flames of a fire, some through speech from the sound of a roaring ocean, some through speech from the sound of the rumbling of an earthquake, some through speech from the sound and noise of great mountains striking against and buffeting one another, some through speech from the melodious sound of the shaking of the cities of the devas, some through speech from the sound of divine aerial palaces buffeting one another, some through the speech of the lords of the devas;

source: ལ་ལ་ལ་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་མིའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ཚངས་པའི་དབང་པོའི་སྐད་ཀྱིས། ལ་ལ་ལ་ནི་ལྷ་མོའི་གླུའི་དབྱངས་ཀྱིས། ལ་ལ་ལ་ནི་ལྷ་རྫས་ཀྱི་རོལ་མོ་ལེགས་པར་བླངས་པའི་དབྱངས་ཀྱིས།
en: some through the speech of the lords of the nāgas, some through the speech of the lords of the yakṣas, some through the speech of the lords of the gandharvas, some through the speech of the lords of the asuras, some through the speech of the lords of the garuḍas, some through the speech of the lords of the mahoragas, some through the speech of the lords of the kinnaras, some through the speech of the lords of the humans, some through the speech of the lords of the Brahmā devas, some through the speech of the songs of the apsarases, some through speech from the playing of divine music, some through speech sounding from precious jewels, and some through the speech of all the various classes of beings, describing to beings the scope of the liberation of the night goddess Pramudita­nayana­jagad­virocanā.

source: ལ་ལ་ལ་ནི་ནོར་བུ་རིན་པོ་ཆེའི་སྒྲ་དབྱངས་ཀྱི། ལ་ལ་ལ་ནི་སེམས་ཅན་གྱི་རིས་ཐམས་ཅད་ཀྱི་སྐད་སྣ་ཚོགས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་རྣམ་པར་ཐར་པའི་ཡུལ་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་རྗོད་པ་མཐོང་ངོ་། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་སྤྲིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྒྲ་སྐད་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའི་སྐུའི་སྤྲིན་གྱིས་དེ་བཞིན་གཤེགས་པའི་གསུང་རྣམ་པ་ཐ་དད་པའི་དབྱངས་ཀྱི་ཡན་ལག་གི་ཚུལ་གྱིས་མཚན་མོའི་ལ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་རྣམ་པར་ཐར་པའི་ཡུལ་ཐོག་མ་སེམས་བསྐྱེད་པ་དང་བཅས་པ་ཡོངས་སུ་བྱུང་སྟེ། གྲུབ་ཅིང་ཡང་དག་པར་འདུས་པ་དང་བཅས་རྣམ་པར་ཐར་པའི་རྣམ་པར་རྩེ་བ་དང་བཅས་པ།
en: In the same way, he saw clouds of bodhisattva bodies with various kinds of bodhisattva speech and clouds of emanated tathāgatas, with the ways of the aspects of voice of the different kinds of speech of each tathāgata and describing to all beings the range of the liberation of the night goddess Pramudita­nayana­jagad­virocanā, including the first occurrence of developing the aspiration to enlightenment and the accumulation of accomplishments.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རྣམ་པར་དམིགས་པར་བྱེད་པ་མཐོང་ངོ་། །དེའི་སྤྲུལ་པའི་གཟུགས་ཀྱི་སྤྲིན་རེ་རེས་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་རྣམ་པར་སྦྱོང་བ་མཐོང་ངོ་།
en: He saw that each of those clouds of emanated forms purified, in each instant of mind, an anabhilāpyānabhilāpya of buddha realms in the world realms in the ten directions.

source: །སེམས་ཅན་རྒྱ་མཚོ་མཐའ་ཡས་པ་དག་ཀྱང་ངན་སོང་གི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་རྣམ་པར་འགྲེལ་པ་མཐོང་ངོ་།
en: He saw them liberating an infinite ocean of beings from all the sufferings of the lower realms.

source: །སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་། དབུས་མེད་པ་དག་ཀྱང་མིའི་ཕུན་སུམ་ཚོགས་པ་ལ་རབ་ཏུ་འགོད་པ་མཐོང་ངོ་།
en: He saw them establishing realms of beings, without limit or center, in the good fortune of devas and humans.

source: །སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་འཁོར་བའི་རྒྱ་མཚོ་ལས་གྱེན་དུ་བསྐྱོད་པ་མཐོང་ངོ་།
en: He saw them freeing an ocean of beings, without limit or center, from the ocean of saṃsāra.

source: །སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་རབ་ཏུ་འགོད་པ་མཐོང་ངོ་།
en: He saw them establishing an ocean of beings without limit or center on the śrāvaka and pratyeka­buddha levels.

source: །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་སྟོབས་བཅུའི་ཡེ་ཤེས་ཀྱི་སར་འཛུད་པ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: Sudhana, the head merchant’s son, saw them bringing, in each instant of mind, an ocean of beings, without limit or center, to the level of the ten strengths.

source: །ཐོས་སོ་རྣམ་པར་དཔྱད་དོ། །ཞུགས་སོ་ཁོང་དུ་ཆུད་དོ། །ངེས་པར་རྟོགས་སོ། །རྗེས་སུ་ཤེས་སོ། །རྗེས་སུ་འབྲངས་སོ།
en: He heard them, contemplated them, scrutinized them, comprehended them, understood them, knew them, followed them, fathomed them, and was resolved as to their equality.

source: །རྗེས་སུ་ཞུགས་སོ། །མཉམ་པ་ཉིད་དུ་བྱིན་གྱིས་བརླབས་ཏེ། དེ་ནི་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོས་དགའ་བ་ཤིན་ཏུ་ཡངས་པའི་རྒྱ་མཚོ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བའི་བྱིན་དང་། སྔོན་སྐལ་པ་མཉམ་པར་སྤྱད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་དུ་བརླབས་པ་དང་། དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོའི་སྣོད་དུ་གྱུར་པའི་ཕྱིར་རོ།
en: This was because of the night goddess Pramudita­nayana­jagad­virocanā’s having become an appropriate vessel for the completely good bodhisattva conduct, her supremacy through the miracles of the bodhisattva liberation called the vast bannerof inconceivable, completely good joy, her corresponding practice in the past, her being blessed by the blessings of the tathāgatas, and the ripening of her countless roots of merit.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་དགའ་བའི་ཤུགས་དྲག་པོ་གང་ཆེན་མཚོ་སྣང་བ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ། ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དེས། མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བའི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then Sudhana, the head merchant’s son, who had attained the illumination of an ocean of the power of great bodhisattva joy, who had been blessed by all the tathāgatas in the ten directions, placed his hands together in homage and praised the night goddess Pramudita­nayana­jagad­virocanā with these appropriate verses:

source: །རྒྱལ་པའི་ཆོས་རྣམས་ཤིན་ཏུ་ཟབ།
en: “The Dharma of the jinas is profound.

source: །དེ་ལ་ཁྱོད་ཀྱིས་བསྐལ་པ་ཚད་མེད་བསླབས།
en: You trained in it for countless kalpas.

source: །བསམ་པ་ཇི་བཞིན་གཟུགས་རྣམས་ཀྱིས།
en: In successive forms that accord with dispositions,

source: །འགྲོ་བ་ཀུན་བཀང་འཇིག་རྟེན་རིམ་པས་བསྟན།
en: You pervade all beings and appear in worlds.

source: །བདག་མེད་མགོན་མེད་ལོག་པ་ཡི།
en: “Knowing that they have no self and no protector,

source: །འདུ་ཤེས་རྟག་ཏུ་འཁྲུལ་པ་མཁྱེན་གྱུར་ནས། །རྫུ་འཕྲུལ་རྣམ་པ་དུ་མ་ཡིས།
en: Have incorrect conceptions, and are continually deluded,

source: །ལུས་དང་དབང་ཕྱུག་སྟོན་མཛད་འགྲོ་བ་འདུལ།
en: You guide beings by manifesting bodies and powers Through various kinds of miracles.

source: །ཤིན་ཏུ་རིམས་བྲལ་རབ་ཏུ་ཞི།
en: “Completely free from fevers, in perfect peace,

source: །ཆོས་སྐུ་གཉིས་མེད་རྣམ་པར་དག་པར་མངའ། །འགྲོ་བ་མ་ལུས་གཉིས་གནས་པ།
en: You have a pure, nondual Dharma body.

source: །སྤྲུལ་པའི་སྤྲིན་སྒྲ་འབྲུག་གིས་རྣམ་པར་འདུལ།
en: You guide through the thunder of clouds of emanations

source: །ཕུང་པོ་ཁམས་དང་སྐྱེ་མཆེད་ལ།
en: All beings, without exception, who are dependent on duality.

source: །ཁྱོད་ནི་ནམ་ཡང་མི་གནས་མི་རྟེན་ཏེ།
en: “You are never dependent, never reliant On the skandhas , āyatanas, and dhātus

source: །ཡན་ལག་ཀུན་རྒྱས་གཟུགས་མཆོག་དང་། །དབང་ཕྱུག་ཡོངས་སུ་བསྒྲགས་པས་འགྲོ་བ་འདུལ།
en: You have a perfect form with all limbs complete, And you guide with your roar of supremacy.

source: །ཕྱི་དང་ནང་ལས་རྣམ་པར་གྲོལ།
en: “You are liberated internally and externally.

source: །གཉིས་ལས་བྱུང་བའི་མཚོ་ལས་འཕགས་གྱུར་ཀྱང་།
en: You have risen above the ocean of duality, Yet you manifest illusory forms for beings

source: །འཁོར་བའི་རྒྱ་མཚོ་མཐའ་ཡས་པའི། །གཟུགས་བརྙན་འགྲོ་བའི་རྒྱུད་དུ་རབ་ཏུ་སྟོན།
en: In the infinite ocean of saṃsāra.

source: །ཁྱོད་ལ་གཡོ་བ་མི་མངའ་སྟེ།
en: “You do not vacillate.

source: །ནམ་ཡང་རློམ་སེམས་གཡོ་བའི་སྤྲོས་མི་མངའ། །འཇིག་རྟེན་སྤྲོས་མོས་བྱིས་པ་རྣམས།
en: You are not complicated by pride or hurry.

source: །ཆོས་ཀྱི་རང་བཞིན་སྟོན་ཅིང་འདུལ་བ་མཛད།
en: You teach the nature of phenomena And guide the fools in the world who delight in complication.

source: །ཏིང་འཛིན་རྒྱ་མཚོ་ཀུན་སྤྱོད་པས།
en: “Through remaining in an ocean of samādhis,

source: །བསྐལ་པ་མང་པོར་རྩེ་གཅིག་ཐུབ་བཞུགས་ཀྱང་།
en: Your mind is one-pointed for many kalpas,

source: །ཕྱོགས་བཅུའི་བདེ་གཤེགས་མཆོད་དོན་དུ། །སྤུ་རྣམས་རྩེ་ལས་སྤྲུལ་པའི་སྤྲིན་ཀྱང་འགྱེད།
en: Yet you emit clouds of emanations from your pores So as to make offerings to the sugatas in the ten directions. “In every single instant of mind, you comprehend

source: །སངས་རྒྱས་སྟོབས་ལ་འཇུག་པའི་ཚུལ། །སྐད་ཅིག་རེ་རེར་མཐའ་ཡས་ཐུགས་སུ་ཆུད། །སེམས་ཅན་བསྡུ་བའི་སྦྱོར་བ་རྣམས།
en: The ways of entering into the strengths of the buddhas.

source: །སོ་སོའི་རྐྱེན་བཞིན་གོ་བར་བགྱི་བས་བསྟན།
en: According to individual circumstances, you manifest The undertakings that will gather beings around you.

source: །ཁྱོད་ཀྱིས་སྲིད་པའི་རྒྱ་མཚོ་དག །ལས་ཀྱིས་རྣམ་བྲིས་སྣ་ཚོགས་གཟུགས་གཟིགས་ཤིང་།
en: “You see the oceans of existence And the various forms painted by karma. You purify all beings by showing them

source: །ཆོས་ཀྱི་སྒྲིབ་པ་མེད་པའི་ལམ་བསྟན་ཏེ། །སེམས་ཅན་ཀུན་ཀྱང་རྣམ་པར་སྦྱོང་བ་མཛད།
en: The unobscured path of the Dharma.

source: །ཁྱོད་སྐུ་མཚན་བྲིས་རྣམ་དག་ཀྱང་།
en: “Your body is beautified by the signs of a great being,

source: །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དམ་པ་ཡིས། །སེམས་ཅན་བསམ་པའི་དབང་ཚུལ་དུ།
en: But through the pure, perfectly good conduct,

source: །ཁྱོད་ནི་ལྷ་མོའི་སྐུ་གཟུགས་ས་སྟོན།
en: You manifest in the world the form of a goddess

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས།
en: In accordance with the dispositions of beings.”

source: མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: Having praised the night goddess Pramudita­nayana­jagad­virocanā with those verses, Sudhana asked, “Goddess, how long has it been since you entered into attaining the highest, complete enlightenment?

source: ལྷ་མོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཤིན་ཏུ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་འདི་ཐོབ་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: Goddess, how long has it been since you attained the bodhisattva liberation called the banner of the power of vast, stainless, completely good joy

source: དེ་ནས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The night goddess Pramudita­nayana­jagad­virocanā recited these verses to Sudhana, the head merchant’s son:

source: དྲན་པ་བསྐལ་པ་མང་འདས་པ།
en: “I remember, in the past, as many kalpas ago

source: །ཞིང་གི་རྡུལ་སྙེད་དེ་ཡི་སྔ་རོལ་ན།
en: As there are atoms in a realm,

source: །ཞིང་ནི་རིན་ཆེན་མདོག་བདེ་འབྱུང་།
en: There was the realm Maṇi­prabha­sukhābha

source: །དེ་ཡི་བསྐལ་པ་ཞི་བའི་དབྱངས་ཤེས་བྱ།
en: In a kalpa called Praśantaghoṣa.

source: །གླིང་བཞི་བྱེ་བ་ཁྲག་ཁྲིག་སྟེ། །བརྒྱ་སྟོང་ཕྲག་བཅུ་རྣམས་ཀྱིས་ཡོངས་སུ་གང་། །ཚད་མེད་རིན་ཆེན་རི་བོ་འདྲ།
en: “It was filled with ten thousand quintillion Four-continent world realms.

source: །གླིང་བཞི་བར་མ་བཟང་པོ་རྣམ་པར་བཀྲམ། ས།
en: The central four-continent world, beautifully formed, Resembled a measureless mountain of jewels.

source: རྒྱལ་པོའི་ཕོ་བྲང་བྱེ་བ་བརྒྱ།
en: “It was filled by the king’s cities

source: །སྟོང་ཕྲག་བཅུ་རྣམས་ཡོངས་སུ་ཚང་བ་སྟེ།
en: Numbering ten thousand quintillion.

source: །རྒྱལ་པོའི་ཕོ་བྲང་མདངས་དགའ་བ།
en: The beautiful central royal city,

source: །དབུས་ན་གནས་པ་སྤོས་ཀྱི་རྒྱལ་མཚན་འོད།
en: Gandhadhvajā, shone with jewels.

source: །དེར་ནི་ཕྱོགས་ཀྱི་དབང་པོ་ས་ཡི་བདག །འཁོར་ལོས་སྒྱུར་བ་མངོན་པར་གཟུགས་བཟང་བྱུང་།
en: “There a lord of the directions, sovereign of the land, A cakravartin with a handsome body, appeared.

source: །མཚན་རབ་སུམ་ཅུ་གཉིས་དང་ལྡན།
en: He had the thirty-two signs of a great being,

source: །དེ་ཡི་ལུས་ཀྱང་དཔེ་བྱད་བཟང་པོས་བརྒྱན།
en: And the features of a great being also adorned his body.

source: །པད་མོའི་སྦུབས་ནས་རྫུས་ཏེ་བྱུང་།
en: “He was miraculously born from inside a lotus.

source: །གསེར་གྱི་མདོག་བཟང་འོད་བྱུང་ལུས་དང་ལྡན།
en: His body was golden and shone with light.

source: །འཛམ་བུའི་རྒྱལ་མཚན་ཐམས་ཅད་དུ། །མཁའ་ལས་འགྲོ་ཞིང་འོད་ཀྱིས་དེ་འགེངས་སོ།
en: He moved through the sky and filled with light The entirety of Jambudhvaja.

source: །དེ་ཡི་བུ་ནི་སྟོང་ཚང་སྟེ།
en: “He had a full thousand sons,

source: །ཀུན་ཀྱང་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན།
en: All of whom had bodies with excellent limbs.

source: །བློན་པོ་མཁས་ཤིང་གསལ་བ་དང་། །མཛངས་ཤིང་ཡིད་གཞུངས་བྱེ་བ་ཤིན་ཏུ་མང་།
en: He had many millions of ministers Who were wise, intelligent, learned, and honest.

source: །བཙུན་མོ་བྱ་བ་ཕྲག་བཅུ་ཚང་།
en: “He had a full hundred million queens

source: །ལྷ་མོ་ཇི་བཞིན་དགའ་བའི་ཚུལ་ལ་མཁས།
en: Who resembled apsarases, were skilled in the art of pleasure,

source: །དེ་དག་ཕན་སེམས་བདེ་སེམས་ཀྱིས།
en: And with loving minds, caring minds,

source: །རྒྱལ་པོ་དེ་ལ་ཉེ་བའི་ཡིད་དུ་གནས།
en: Affectionately attended that king.

source: །རྒྱལ་པོ་དེ་ནི་ས་ཆེན་དེ། །རི་དང་ཁོར་ཡུག་ཀུན་གྱི་མཐས་ཀླས་པའི།
en: “That king, through the power of the Dharma,

source: །གླིང་བཞིའི་ཕུན་སུམ་ཚོགས་པ་དག །ཀུན་ཀྱང་ཆོས་ཀྱི་སྟོབས་ཀྱིས་གནས་པར་བྱེད།
en: Caused that great land, the entirety of the four continents As far as the Cakravāla mountain range, To remain in a state of good fortune.

source: །ཁོ་མོ་འཁོར་ལོས་སྒྱུར་བ་ཡི།
en: “I was that cakravartin’s principal queen.

source: །བཙུན་མོ་ཚངས་པའི་སྒྲ་སྐད་རིན་ཆེན་ལུས།
en: I had the voice of Brahmā and a bejeweled body,

source: །གསེར་གྱི་མདོག་འཆང་དྲི་མེད་འོད།
en: With a bright halo the color of gold

source: །དཔག་ཚད་སྟོང་དུ་འོད་ཀྱིས་རྒྱས་པར་འགེངས།
en: That illuminated for a thousand yojanas.

source: །ཉི་མ་ནུབ་པར་གྱུར་ནས་ཀྱང་།
en: “After the sun had set

source: རྒྱལ་པོ་སྲས་དང་འཁོར་བཅས་གཟིམས་གྱུར་ནས།
en: And the king and his sons were asleep

source: །རོལ་མོའི་དབྱངས་ཀྱང་ཞི་གྱུར་ཏེ།
en: And the sound of music had ceased,

source: །ཁོ་མོ་མལ་ན་བདེ་བར་ཉལ་ཉལ་ན།
en: I slept comfortably on my bed.

source: །ནམ་གྱི་ཕྱེད་ཙམ་གུང་ཞིག་ལ།
en: “In the middle of the night,

source: །སངས་རྒྱས་དཔལ་གྱི་རྒྱ་མཚོ་བྱུང་བར་གྱུར།
en: The Buddha Śrisamudra appeared.

source: །དེ་ཚེ་རྒྱལ་བས་རྣམ་འཕྲུལ་བ།
en: The Jina manifested limitless miracles

source: །ཕྱོགས་བཅུ་རྒྱས་པར་བཀང་སྟེ་བསྟན་པ་མཛད།
en: That spread throughout the ten directions.

source: །རྒྱལ་བའི་འོད་ཟེར་རྒྱ་མཚོ་དེས།
en: “That ocean of the Jina’s light

source: །ཞིང་གི་རྡུལ་སྙེད་འཇིག་རྟེན་ཁྱབ་པར་གྱུར།
en: Spread through worlds as numerous a realm’s atoms.

source: །རྣམ་འཕྲུལ་སྐུ་རྣམས་སྣ་ཚོགས་ཀྱིས།
en: Various kinds of emanated bodies

source: །ཕྱོགས་བཅུ་ཐམས་ཅད་མ་ལུས་རྒྱས་པར་བཀང་།
en: Filled all ten directions without exception.

source: །ས་རྣམས་རི་དང་བཅས་པར་གཡོས།
en: “The earth and its mountains shook,

source: །རྒྱལ་བ་བྱུང་ཞེས་སྒྲ་ཡང་ཡོངས་སུ་བརྗོད།
en: And a voice proclaimed, ‘A jina has come!’

source: །ལྷ་དང་ལྷ་མིན་མི་དང་ཀླུ།
en: Devas, asuras, humans, and nāgas

source: །ཀུན་ཀྱང་རྒྱལ་བ་བྱུང་བས་རབ་ཏུ་དགའ། །སངས་རྒྱས་བ་སྤུའི་སྒོ་ཀུན་ནས།
en: Were all delighted that a buddha had appeared.

source: །སྤྲུལ་པའི་རྒྱ་མཚོ་མང་པོ་མངོན་པར་བྱུང་།
en: “Many oceans of emanations appeared From all the pores of the Buddha.

source: །དེས་ནི་ཕྱོགས་བཅུ་རྒྱས་བཀང་ནས།
en: They spread throughout the ten directions

source: །འཇིག་རྟེན་བསམ་པ་བཞིན་དུ་ཆོས་ཀྱང་བསྟན།
en: And taught the Dharma in accordance with the aspirations of beings. “The Jina revealed to me in a dream

source: །རྣམ་འཕྲུལ་མཐའ་ཡས་དེ་དག་ཀྱང་། །རྒྱལ་བས་ཐམས་ཅད་བདག་གི་རྨི་ལམ་བསྟན།
en: All those limitless miraculous manifestations.

source: །ཟབ་མོའི་འབྲུག་སྒྲ་ཐོས་གྱུར་ནས།
en: When I heard the profound thunderous sound,

source: །ཁོང་དུ་ཆུད་པས་ཁོ་མོ་དགའ་ཡིད་གྱུར།
en: I understood its meaning and was delighted.

source: །མཚན་མོའི་ལྷ་མོ་སྟོང་སྟེང་ཀྱང་།
en: “Ten thousand night goddesses

source: །ཁོ་མོའི་སྟེང་གི་བར་སྣང་མཁར་གནས་ཤིང་།
en: Residing in the sky above me Spoke to me, waking me from sleep,

source: །རྒྱལ་བའི་ལེགས་པ་བརྗོད་བྱས་ནས། །ཁོ་མོ་སད་པར་སྨྲ་ཞིང་བརྗོད།
en: Praising the excellence of the Jina.

source: །ལྷ་ཡི་བློ་གྲོས་བཙུན་མོ་ལོངས།
en: ‘Arise, wise queen of His Majesty,

source: །ཁྱོད་ཀྱི་རྒྱལ་པོའི་ཁམས་སུ་རྒྱལ་བ་སྐྱེས།
en: A jina has appeared in your kingdom. This kind of good fortune is difficult to find

source: །བསྐལ་པ་རྒྱ་མཚོ་བརྒྱ་དག་ཏུ།
en: Even in a hundred oceans of kalpas.’

source: །དེ་འདྲའི་ཕུན་སུམ་ཚོགས་པ་རྣམ་དག་ཀུན། །ཁོ་མོ་དགར་གྱུར་སད་པར་གྱུར།
en: “I awoke with happiness

source: །འོད་གསལ་དྲི་མེད་རྣམ་དག་མཐོང་།
en: And saw the clear, pure light.

source: །འོད་བཟང་དེ་ནི་ག་ལས་བལྟ་བལྟ་ན།
en: I looked to see where this good light came from

source: །བྱང་ཆུབ་ཤིང་རྒྱལ་དྲུང་གི་རྒྱལ་བ་མཐོང་།
en: And saw the Jina at the foot of the Bodhi tree.

source: །མཚན་ཉིད་སུམ་ཅུ་གཉིས་ཀྱིས་བརྒྱན།
en: “He was adorned by the thirty-two signs of a great being,

source: །བ་སྤུ་ཀུན་ནས་འོད་ཟེར་རྒྱ་མཚོ་བཀྱེ།
en: And an ocean of light rays shone from all his pores.

source: །རི་རབ་ཇི་བཞིན་མངོན་པར་འཕགས།
en: Just like Sumeru he was above all,

source: །རྒྱལ་བ་གཡས་གཡོས་ཀུན་ཏུའང་དེ་བཞིན་ནོ།
en: And the Jina was the same on the right and the left.

source: །མཐོང་ནས་ཁོ་མོ་རབ་དགའ་སྟེ།
en: “When I saw him I was overjoyed,

source: །དེ་འདྲར་འགྱུར་བར་སེམས་ཀྱང་ཡོངས་སུ་བསྐྱེད།
en: And in my mind rose the aspiration to be like him.

source: །སངས་རྒྱས་རྣམ་འཕྲུལ་ཡངས་མཐོང་ནས།
en: Having seen the manifestations of the Buddha,

source: །ཁོ་མོས་སྨོན་ལམ་ཤིན་ཏུ་རྒྱ་ཆེན་བཏབ།
en: I made a very vast prayer.
